<?php require $includes . 'public_top.html.php'; ?>
<h2>重刊廣韻序</h2>
<p>聲韻之學盛于六代周顒以天子聖哲分四聲而學者言韻悉本沈約顧其書終莫有傳者今之廣韻源於陸法言切韻而長孫納言爲之箋注者也其後諸家各有增加已非廣韻之舊然分韻二百有六部未之紊焉自平水劉淵淳祐中始併爲一百七韻於是合殷于文合隱于吻合焮于問盡？唐人之官韻好異者又惑于婆羅門書取華嚴字母三十有六顚倒倫次審其音而紊其序逮洪武正韻出脣齒之不分淸濁之莫辨雖以天子之尊行之不遠則是非之心人皆有之矣曩崑山顧處士炎武挍廣韻力欲復古刊之淮陰苐仍明內庫鏤板縁古本箋注多寡不齊中㳙取而删之略均其字數頗失作者之旨吴下張上舎士俊有憂之訪諸琴川毛氏得宋時鋟本證以藏書家所傳抄務合乎景德祥符而後已抑何其用力之勤與嗟夫韻學之不講久矣近有嶺外妄男子僞撰沈約之書以眩于丗信而不疑者有焉幸而廣韻僅存則天之未喪斯文也吾故序之俾海內之言韻者必以是書爲準康𤋮四十有三年六月秀水朱彞尊書</p>
<h2>重刊古本廣韻序</h2>
<p>吳門張氏刻古本廣韻成余亟稱其書之善謂古音之條理猶可攷見者獨賴此書之存文人學士宜家置一編而人或未喻有問余者曰韻爲詩設也詩人用韻樂寬而苦狹今丗俗通行之譜僅一百七韻此書乃分爲二百六韻得無繁碎而窘於押用乎荅曰韻本乎聲聲之自出有脣舌齒牙喉之異有輕重淸濁陰陽之殊其播爲音也有宫商角徵羽之辨昔人精於審音條分縷析如冬鍾必分爲二支脂之必分爲三删山先仙必分爲四豈好爲繁𤨏哉亦本其自然之音使各得其所而已後丗讀字失其本音不曉分韻之故遂舉而併省之使古音之相近而不相侵者雜然混而爲一失莫甚焉賴有此書而最初立韻之部分犁然具在蓋自陸法言等數人斟酌古今南北勒成一書歷代增修雖有切韻唐韻廣韻之異名而部分無改唐宋用以取士謂之官韻與九經同頒無敢出入宋末元初始加改併名爲併其所通用實則非通而併且闌入他韻者多矣今學詩者必宗唐宋而用韻不從唐宋其可乎從此書所標之通用者韻固未甞狹也而無訛濫之失不亦善乎客曰部分則聞命矣書中收字太多不盡適於用且有一字而三四韻並收者於義何居曰此書之作不專爲韻也取說文字林玉篇所有之字而畢載之且增益其未備釐正其字體欲使學者一覽而聲音文字包舉無遺故說文字林玉篇之書不可以該音學而廣韻一書可以該六書之學其用宏矣若夫一字而具數音或有異義或無異義此即轉注假借之法屈宋以降迄唐名人率多用之自後丗删去複字而古人有韻之文多不可讀一披廣韻而其字具在非出韻也非叶韻也夫韻書之作非專爲詩非專爲近體也以爲賦頌箴銘以爲長篇古體惟恐其字之易盡也而何嫌於繁乎曰本文之浩博可也小注則粗明字義可矣而何姓氏地理物類方言之旁羅曲載乎曰此正古人之善著書也其人旣博極古今而爲書之意欲舉天地民物之大悉入其中凡經史子志九流百家僻書隱籍無不摭采一公字也而載人姓名至千有餘言一楓字也而蚩尤桎梏化楓楓脂入地千年變虎魄之說無不備録不惟學者可以廣異聞資多識而丗本姓苑百家譜英賢傳續漢書魏略三輔決録等古書數十種不存於今者賴其徵引班班可見有功於載籍亦大矣而近代刻廣韻者盡删去之此古本之所以尤可貴也先師顧亭林深明音學憫學者泥今而昧古實始表章此書刻之淮上然其所見乃內府刊本已經删削者久而覺其書之不完作後序以志遺憾近歳耒始見宋鋟本於崑山徐相國家借録以歸張子士俊孜孜好古得舊刻於毛氏而缺其一帙余乃畀以冩本精加挍讎梓之行丗因以告客之語書于𥳑端若夫極論古今音之異同得失而折衷之以經則有先師之音學五書在學者究觀焉可也舊史氏松陵潘耒書</p>
<h2>大宋重修廣韻一部</h2>
		<p>凡二万六千一百九十四言</p>
		<p>注一十九万一千六百九十二字</p>
		<p>準景德四年十一月十五日</p>
		<p>勅四聲成文六書垂法乃經籍之資始寔𥳑𠕋之攸先自吳楚辨音隷古分體年祀？逺攻習多門偏旁由是差譌傳寫以之漏落矧注解之未備諒敎授之何從爰命討論特加刊正仍令摹印用廣頒行期後學之無疑俾永代而作則宜令崇文院雕印送國子監依九經書例施行牒至準</p>
		<p>勅故牒</p>
		<p>又準大中祥符元年六月五日</p>
		<p>勅道有形器之適物有象數之滋一爻始畫於龍圖八體遂生於鳥跡書契是造文字㪍興踵事增華觸類浸長沿賡載以變本尚辝律之諧音集韻成書抑亦久矣朕聿遵</p>
		<p>先志導揚素風設敎崇文懸科取士考覈程準兹實用焉而舊本旣譌學者多誤必豕魚之盡革乃朱紫以洞分爰擇儒臣叶宣精力校讎增損皆正刊修綜其綱條灼然敘列俾之摹刻垂于將來仍特換於新名庶永昭於成績宜改爲大宋重修廣韻牒至準勅故牒</p>
		<p>陸法言撰本</p></p>長孫訥言箋注</p>
		<p>儀同三司劉臻</p></p>外史顔之推</p>
		<p>著作郎魏淵武</p></p>陽太守盧思道</p>
		<p>散騎常侍李若</p></p>國子博士蕭該</p>
		<p>蜀王諮議參軍辛德源</p>
		<p>吏部侍郎薛道衡</p><p>已上八人同撰集</p>
		<p>郭知𤣥拾遺緒正更以朱箋三百字</p>
		<p>關亮增加字薛峋增加字</p>
		<p>王仁煦增加字祝尚丘增加字</p>
		<p>孫愐增加字嚴寶文增加字</p>
		<p>裴務齊增加字陳道固增加字</p>
		<p>更有諸家增字及義理釋訓悉纂略備載卷中勒成一部進上</p>
		<p>勅賜絹五百疋</p>
		<p>昔開皇初有儀同劉臻等八人同詣法言門宿夜永酒闌論及音韻以今聲調旣自有别諸家取捨亦復不同吳楚則時傷輕淺燕趙則多傷重濁秦隴則去聲爲入梁益則平聲似去又</p>
			<ul><li>支 章移切
			</li>
			<li>脂 旨夷切
			</li>
			<li>魚 語居切
			</li>
			<li>虞 遇俱切
			</li>
			共爲一韻
			<li>先 蘇前切
			</li>
			<li>仙 相然切
			</li>
			<li>尤 于求切
			</li>
			<li>侯 胡溝切
			</li></ul>
			<p>俱論是切欲廣文路自可淸濁皆通若賞知音即須輕重有異吕靜韻集夏侯該韻略陽休之韻略周思言音韻李季節音譜杜臺卿韻略等各有乖互江東取韻與河北復殊因論南北是非古今通塞欲更捃選精切除削䟽緩蕭顔多所決定魏著作謂法言曰向來論難疑處悉盡何不隨口記之我輩數人定則定矣法言即燭下握筆略記綱紀博問英辯殆得精華於是更涉餘學兼從薄宦十數年閒不遑修集今返初服私訓諸弟子凡有文藻即須明聲韻屏居山野交游阻絕疑惑之所質問無從亡者則生死路殊空懷可作之歎存者則貴賤禮隔以報絕交之旨遂取諸家音韻古今字書以前所記者定之爲切韻五卷剖析豪氂分别黍累何煩泣玉未得縣金藏之名山昔怪馬遷之言大持以蓋醬今歎楊雄之口吃非是小子專輒乃述羣賢遺意寧敢施行人丗直欲不出戸庭于時歳次辛酉大隋仁壽元年訥言曰此製酌古沿今無以加也然古傳之已久多失本源差之一畫詎惟千里見炙從肉莫究厥由輒意形聲固當從夕及其晤矣彼乃乖斯若靡馮焉他皆倣此頃佩經之隙沐雨之餘楷其紕繆疇兹得失銀鉤創閲晉豕成羣盪櫛行披魯魚盈貫遂徵金篆遐泝石渠略題㑹意之辝仍記所由之典亦有一文兩體不復備陳數字同歸惟其擇善勿謂有增有減便慮不同一㸃一畫咸資别據其有類雜竝爲訓解傳之不謬庶埓箋云于時歳次丁丑大唐儀鳳二年</p>
		<p>前費州多田縣丞郭知𤣥拾遺緒正更以朱箋三百字其新加無反音皆同上音也</p>
		<p>陳州司法孫愐唐韻序</p>
		<p>蓋聞文字聿興音韻乃作蒼頡爾䪵爲首詩頌次之則有字統字林韻集韻略述作頗衆得失互分惟陸生切韻盛行於丗然隨珠尚纇虹玉仍瑕注有差錯文復漏誤若無刊正何以討論我國家偃武修文大崇儒術置集賢之院召才學之流自開闢以來未有如今日之盛上行下效比屋可封輒罄謏聞敢補遺闕兼習諸書具爲訓解州縣名号亦據今時字體從木從才著彳著亻施殳施攴安尒安禾並悉具言庶無紕繆其有異聞奇怪傳說姓氏原由土地物産山河草木鳥獸蟲魚備載其閒皆引馮據隋韻編紀添彼數家勒成一書名曰唐韻蓋取周易周禮之義也及案三蒼爾雅字統字林說文玉篇石經聲韻聲譜九經諸子史漢三國志晉宋後魏周隋陳宋兩齊書本草姓苑風俗通古今注賈執姓氏英賢傳王僧孺百家譜周何潔集文選諸集孝子傳輿地志及武德已來創置迄開元三十年並列注中等夫輿誦流汗交集愧以上陳天心又有元青子吉成子者則汝陽侯榮之曾孫卓尒好古博通内外遁禄巖嶺吐納自然抗志鈐鍵棲神梵宇淡泊無事希夷絕塵倏忽風雲靈燄怡懌考窮史籍廣覽羣書欲令淸濁昭然學之上有終日而忘食有連宵而不寐案搜神記精怪圖山海經博物志四夷傳大荒經南越志西域記西壑傳漢纂藥論證俗方言御覽字府及九經三史諸子中遺漏要字訓義解釋多有不載必具言之子細研窮究其巢穴澄凝微思鄭重詳思輕重斯分不令慁糅緘之金篋珍之寶之而已哉寧辝阻險敢不躬談一訴愚心克諧雅況依次編記而不别番其一字數訓則執優而尸之劣而副之其有或假不失元本以四聲尋譯冀覽者去疑宿滯者害如也又紐其脣齒喉舌牙部仵而次之有可紐不可行之及古體有依約之並采以爲證庶無壅而昭其馮起終五年精成一部前後緫加四萬二千三百八十三言仍篆隷石經勒存正體幸不譏繁于時歳次辛卯天寶十載也</p>
		<p>論曰切韻者本乎四聲紐以雙聲疊韻欲使文章麗則韻調精明於古人耳或人不達文性便格於五音爲足夫五音者五行之響八音之和四聲閒迭在其中矣必以五音爲定則參宫參羽半徵半商引字調音各自有淸濁若細分其條目則令韻部繁碎徒拘桎於文辝耳</p>
<?php require $includes . 'public_bottom.html.php'; ?>
